Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-PRDR
<<< 250-PRDR
??? 250
<<< 250 HELP
>>> mail from:<> PRDR
??? 250
<<< 250 OK, PRDR Requested
>>> rcpt to:<userx@test.ex>
??? 250
<<< 250 Accepted
>>> rcpt to:<usery@test.ex>
??? 250
<<< 250 Accepted
>>> rcpt to:<userz@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Sender: sender@some.where
>>> .
??? 353
<<< 353 PRDR content analysis beginning
??? 250
<<< 250 OK PRDR accepted for userx@test.ex
??? 450
<<< 450 usery@test.ex temporarily refuses the content
??? 550
<<< 550 userz@test.ex refuses the content
??? 250
<<< 250 id=10HmaY-0005vi-00 message accepted for some recipients
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> ehlo rhu.barb
??? 250-
<<< 250-myhost.test.ex Hello rhu.barb [127.0.0.1]
??? 250-
<<< 250-SIZE 52428800
??? 250-
<<< 250-8BITMIME
??? 250-
<<< 250-PIPELINING
??? 250-PRDR
<<< 250-PRDR
??? 250
<<< 250 HELP
>>> mail from:<> PRDR
??? 250
<<< 250 OK, PRDR Requested
>>> rcpt to:<userp@test.ex>
??? 250
<<< 250 Accepted
>>> rcpt to:<userq@test.ex>
??? 250
<<< 250 Accepted
>>> data
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Sender: sender@some.where
>>> .
??? 353
<<< 353 PRDR content analysis beginning
??? 250
<<< 250 OK PRDR accepted for userp@test.ex
??? 250
<<< 250 OK PRDR accepted for userq@test.ex
??? 550
<<< 550 Administrative prohibition
>>> quit
??? 221
<<< 221 myhost.test.ex closing connection
End of script
